## Project6 ###################################################################
# C3조: 오준서, 천성한, 한호종, 황윤수
# 기간: 2021.11.29(월) ~ 2021.12.2(목)

  # 프로젝트 역할분담
  #오준서: 점 차트, 상자 그래프, 변수간의 비교 시각화
  #천성한: 막대 차트, 산점도, 3차원 산점도, 
  #한호종: 원형 차트, 히스토그램, 지도 시각화
  #황윤수: 누적 막대, 중첩자료 시각화, 밀도 그래프

# 환경설정
rm(list=ls())
getwd()
setwd("C:/rwork")
  # 라이브러리 모음
install.packages("ggplot2")
install.packages("plotly")
install.packages("scatterplot3d")

library(ggplot2)
library(plotly)
library(scatterplot3d)

## 1.막대차트(가로,세로) #######################################################




## 2.막대차트(누적) ############################################################




## 3.점 차트 ###################################################################

# 공통 데이터
chart_data <- c(305, 450, 320, 460, 330, 480, 380, 520)
names(chart_data) <- c("2018 1분기 ", "2019 1분기",
                       "2018 2분기 ", "2019 2분기",
                       "2018 3분기 ", "2019 3분기",
                       "2018 4분기 ", "2019 4분기")
# 자료형 변환
point_df <- data.frame(chart_data,names(chart_data))


# graphics 패키지를 이용한 시각화
dotchart(chart_data, color = c("blue", "red"),
         lcolor = "black", pch = 1:2,
         labels = names(chart_data),
         xlab = "매출액",
         main = "분기별 판매현황: 점차트 시각화",cex = 1.2)


# ggplot2 패키지를 이용한 시각화
ggplot(data = point_df,aes(x = chart_data, y = names.chart_data.)) + geom_point()

# plotly 패키지를 이용한 시각화
plot_ly(data = point_df, x = ~chart_data, y = ~names.chart_data., type = 'scatter')




## 4.원형 차트 #################################################################




## 5.상자 그래프 ###############################################################

# 공통 데이터
data("VADeaths")

# graphics 패키지를 이용한 시각화
# 1) 시각화
boxplot(VADeaths, range = 0)
boxplot(VADeaths, range = 0, notch = T)
# 2) 중심선 추가
abline(h = 37, lty = 3, col = "red")


# ggplot2 패키지를 이용한 시각화
# 1) 자료형 변환
VAD <- as.data.frame.table(VADeaths)
colnames(VAD) = c("age","category","Freq")
# 2) 시각화
ggplot(VAD,aes(x = category, y = Freq)) +
  geom_boxplot()


# plotly 패키지를 이용한 시각화
# 1) 자료형 변환
a <- as.data.frame(VADeaths)
# 2) 시각화
plot_ly(a,x=VAD$category,y=VAD$Freq,type = 'box')




## 6.히스토그램 ################################################################




## 7.산점도 ####################################################################




## 8.중첩자료 시각화 ###########################################################




## 9.변수간의 비교 시각화 ######################################################




## 10. 밀도 그래프 #############################################################




## 11. 3차원 산점도 그래프 #####################################################




## 12. 지도 시각화 #############################################################



